const {cmd , commands} = require('../command')

cmd({
    pattern: "H",
    desc: "menu the bot",
    category: "menu",
    react: "📜",
    filename: __filename
},

async(conn, mek, m,{from, quoted, body, isCmd, command, args, q, isGroup, sender, senderNumber, botNumber2, botNumber, pushname, isMe, isOwner, groupMetadata, groupName, participants, groupAdmins, isBotAdmins, isAdmins, reply}) => {
try{
const voice = {
    menu: 'media/AUD-20240904-WA0432.mp3'
}
let dec = `*👋 Hello ${pushname}*

History easy tags ☘❤
*__ ශ්‍රී ලංකාවේ ජාතික පුනරුදය __*

#පළමු කොටස 

🔹 ශ්‍රී ලංකාවට පැමිණි යුරෝපීය ජාතීන් පිළිවෙලින් ,

> ♦ පෘතුගීසීන් (1505-1658)
> ♦ ලන්දේසීන් (1658-1796)
> ♦ ඉංග්‍රීසින් (1796-1948)

♣ මිෂනාරි සමාගමක් යනු
> ක්‍රිස්තියානි ආගම් මෙරට පැතිරවීම සඳහා කටයුතු කළ සංවිධාන වේ.

💠 ලන්ඩන් මිෂනාරි සමාගම
> 1804

💠 බැප්ටිස්ට් මිෂනාරි සමාගම
> 1812
> කොළඹ

💠වෙස්ලියන් මිෂනාරි සමාගම
> 1814-1815
> උතුරු පළාත

💠 ඇමරිකන් මිෂනාරි සමාගම
> 1816
> උතුරු පළාත

💠 චර්ච් මිෂනාරි සමාගම
> 1818
> කොළඹ, ගාල්ල, මහනුවර, මන්නාරම

ලන්ඩන් බෑනා වෙස්වලාගෙන ඇමෙරිකාවට ගිහින් චාමර 💤🥹

☘ මිෂනාරී සංවිධාන විසින් තම ආගම් පැතිරවීම සඳහා යොදාගත් මාධ්‍ය
> ලේඛන කටයුතු
> දේශන කටයුතු
> අධ්‍යාපනය

🔹 මිෂනාරි සංවිධාන විසින් තම ආගම් පැතිරවීම සඳහා ලේඛන මාධය යොදාගත් බවට උදාහරණ
> බයිබලය සිංහල භාෂාවට පරිවර්තනය කිරීම.
> පොත්පත් සඟරා මුද්‍රණය කර බෙදා හැරීම.
> සිංහල හා දෙමළ භාෂා ඉගෙන ගැනීම

🛜 මිෂනාරි සංවිධාන මුද්‍රණය කළ ප්‍රකාශන
> 🔅මාසික තෑග්ග = චර්ච් මිෂනාරි සමාගම
> 🔅 ලංකා නිධානය = ආගමික පුස්තකා සමාගම
> 🔅 උරගල = බැප්ටිස්ට් මිෂනාරි සමාගම

🌀 මිෂනාරි සංවිධාන විසින් තම ආගම් පැතිරවීම සඳහා දේශන මාධ්‍ය හා අධ්‍යාපනය යොදාගත් බවට උදාහරණ
> 💠 මහජනතාව ගැවසෙන තැන් වල දේශන පැවැත්වීම
> 💠 පාසල් ආරම්භ කිරීම
> 💠 ඉංග්‍රීසි දැනුම ඇති අයට රජයේ රැකියා ලබාදීම

🍁 බෞද්ධ පුනර්ධ ව්‍යාපාරය සඳහා ගත් ක්‍රියාමාර්ග
> ♦ මුද්‍රණාල පිහිටුවීම
> ♦ පංච මහා වාද පැවැත්වීම
> ♦ බෞද්ධ පාසල් පිහිටුවීම
> ♦ බෞද්ධ පූජනීය ස්ථාන රැකගැනීම

🪸 බෞද්ධයන් පිහිටවූ මුද්‍රණාල
> සරසවි සඳරැස මුද්‍රණාලය
> කවට කතික මුද්‍රනාලය
> ලංකාභිනව විශ්‍රුත මුද්‍රණාලය
> ලංකෝපකාර මුද්‍රණාලය
> සුදර්ශන මුද්‍රණාලය

🌻 බෞද්ධයන් විසින් ප්‍රකාශයට පත් කරන ලද ප්‍රකාශන
> ලංකා ලෝකය
> ලක් මිණි පහන
> සිංහල ජාතිය
> සිංහල බෞද්ධයා
> සරසවි සඳරැස

🪻 පංච මහා වාද
> • බද්දේගම වාදය
> • වරාගොඩ වාදය
> • උදන්විට වාදය
> • ගම්පොළ වාදය
> • පානදුරාවාදය

⭕ බන්ඩෝ වරෙන් උදේම ගමේ පන්සලට 😉

〽 බෞද්ධ පුනරුද ව්‍යාපාරය උදෙසා හෙන්රි ස්ටිල් ඕල්කට් තුමාගෙන් සිදුවූ සේවාවන් 
> 1. පරම විඥානාර්ථ සමාගම පිහිටුවීම
> 2. බෞද්ධ කොඩිය නිර්මාණය කිරීම
> 3. වෙසක් පොහොය රජයේ නිවාඩු දිනයක් බවට පත් කිරීම
> 4. බෞද්ධ පාසල් පිහිටුවීම

🌀 බෞද්ධ පාසල් පිහිටුවීමට ක්‍රියාකාරී වූ පුද්ගලයන්
> හික්කඩුවේ සුමංගල හිමි
> රත්මලානේ ධර්මාලෝක 
> හෙන්රි ස්ටිල් ඕල්කට් තුමා
> අනගාරික ධර්මපාලතුමා
> ස්පේටර් සේනානායක මහතා

〰〰〰〰〰〰〰〰〰〰〰

Created by, 
 Admin Saranya ✨ 

Copied`

await conn.sendMessage(from,{image:{url: `https://telegra.ph/file/c4fb65879b2c1690691f8.jpg`},caption:dec},{quoted:mek});

}catch(e){
console.log(e)
reply(`${e}`)
}
})
